{
  "id": "32",
  "stream": "computer-science-information-technology",
  "packet": "2021-N",
  "year": "2021",
  "type": "NAT",
  "key": "4108",
  "question_text": "Question 32. \n \n \n \n  \n \n \n \n \nNAT (2M)\nQuestion ID : 8232513148\nConsider a three-level page table to translate a 39 bits virtual address  to a physical address\nAs shown below:\nLevel 1 \noffset\nLevel 2 \noffset\nLevel 3 \noffset\nPage \nOffset\n9 bits\n \n9 bits \n9 bits \n12 bits\n\nThe page size is 4KB (1 KB= 2^10 bytes) and page table entry size at every level is 8 bytes. A\nProcess P is currently using 2GB (1 GB=2^30 bytes) virtual memory which is mapped to 2GB\nOf physical memory. The minimum amount of memory required for the page table of P across\nAll level is_____ KB.",
  "answer_text": "4108",
  "explanation_text": "Sol.\n \nGiven : \nVirtual address(VA) = 39 bits \nPage size = 4 KB \nPhysical address(PA) = 2 GB \nPage table entry size(PTE) = 8 B \nThree level pages tables with address division (9,9,9,12) : \nThree level pages tables with address division (9,9,9,12)  means :\n\nPAGE\n23\n\n9 most significant bits for indexing into the level-1(outer level) , 9 bits for the level-2 index, 9 bits for \nthe level-3 index, and again 12 bits for the offset within a page. The entries of the level-1 page table \nare pointers to a level-2 page table, the entries of the level-2 page table are pointers to a level-3 page \ntable, and the entries of the level-3 page table are PTEs that contain actual frame number where our \ndesired word resides. \n9 bits for a level means 29 entries in one page table of that level. \nFor our process P : \nP is using 2 GB of its VM. The rest of its VM is unused. \n2 GB VM will have 2GB/4KB=219Pages. \nBut level 3 page table has only 29 entries, so, one page table of level 3 can point to 29 pages of VM \nonly, So, we need 210 level-3 page tables of process P. \nSo, at level-3, we have 210 page tables, So, we need 210 entries in Level-2 But level 2 page table has \nonly 29 entries, so, one page table of level 2 can only point to 29 page tables of level-3, So, we \nneed 2 level-2 page tables. \nSo, we need 1 Level-1 page table to point to level-2 page tables. \nSo, For process P, we need only 1 Level-1  page table, 2  level-2 page tables, and 210 level-3 page \ntables. \nNote that All the page tables, at every level, have same size which is 29×8B=212B=4KB \n(Because every page table at every level has 29 entries and Page table entry size at every level is 8B ) \nSo, in total, we need 1+2+210 page tables (1 Level-1, 2 Level-2, 210 level-3), and each page table \nsize is 4KB \nSo, total page tables size = 1027×4KB = 4108KB \nSo, answer is 4108."
}