{
  "id": "44",
  "stream": "computer-science-information-technology",
  "packet": "2022",
  "year": "2022",
  "type": "MCQ",
  "key": "0.6\n\nGATE 2022 \n [Forenoon Session]\nComputer Science Engineering\nPAGE\n31\n\n \n153\n \nD\n \nB, C",
  "question_text": "Question 44\nConsider a demand paging system with four page frames (initially empty) and LRU page replacement \npolicy. For the following page reference string 7, 2, 7, 3, 2, 5, 3, 4, 6, 7, 7, 1, 5, 6, 1 the page fault rate, \ndefined as the ratio of number of page faults to the number of memory accesses. (2 decimal) is _____",
  "answer_text": "0.6\n\nGATE 2022 \n [Forenoon Session]\nComputer Science Engineering\nPAGE\n31\n\n \n153\n \nD\n \nB, C",
  "explanation_text": "Sol.\n7,2,7,3,2,5,3,4,6,7,7,1,5,6,1\nTotal page faults \n9\n\nTotal Access \n15\n\nThus page fault rate \n9 /15\n0.6\n\n\nQ.45 \n Consider two file-systems A and B. that use contiguous allocation and linked allocation respectively A\nfile of size 100 blocks is already stored in A and also in B. Now, consider inserting a new block in the \nmiddle of the file (between 50th and 51st block), whose data is already available in the memory. Assume \nthat there are enough free blocks at the end of the file and that the file control blocks are already in \nmemory. Let the number of disk accesses required to insert a block in the middle of the file in A and B \nare n A and n E respectively, then the value of \nA\nB\nn\nn\n\n is___.\n2 Marks NAT\nSol.\n \nFor contiguous allocation, we have to store all the blocks in a sequence, if we have to store a block in the \nmiddle, we have to first shift all the blocks after that one place right, for which we need one disk read and \none disk write for each block (2 disk accesses). Now since we are storing one block in contiguous\nallocation at \n51\nst\n \n position, the blocks (\n51\nst\n \n to 100\nth\n ) have to be moved one step right, for which 2*50 disk \naccesses are required, then one access to store the new block, thus \n100 1 101\nA\nn\n \n\n.\nIn Linked allocation, we must read 50 blocks to find the middle. Then we must write the new block \nsomewhere with the next block pointing to the block after the 50\nth\n  block. Then we must write the 50\nth\n  \nblock to point to this new block, thus\n50 1 1\n52\nB\nn\n \n\nHence our required answer \nA\nB\nn\nn\n\nis 153.\nQ.46 \nWhich of the following statements is False?   \n \n \n        \n2 Marks MCQ\n(A)  The TLB performs an associative search in parallel on all its valid entries using page number of\nincoming virtual address\n(B)  If the virtual address of a word given by CPU has a TLB hit, but the subsequent search for the word\nresults in cache miss, then the word will always be present in the main memory.\n(C)  In a system that uses hashed page tables, if two distinct virtual address VI and V2 map to the same\nvalue while hashing, then the memory access time of these addresses will not be the same\n\nGATE 2022 \n [Forenoon Session]\nComputer Science Engineering\nPAGE\n32\n\n(D)  The memory access time using a given inverted page table is always same for all incoming virtual\naddresses.\nSol. \nA. True\nTLB Lookups:\n1. \nSequential search of the TLB\n2.  Direct mapping : assigns each virtual page to a specific slot in the TLB e.g., use upper bits of VPA\nto index TLB\n3.  Set associativity: use N TLB banks to perform lookups in parallel\n4.  Fully associative cache: allows looking up all TLB entries in parallel\n5.  Typically\na. TLBs are small and fully associative\nb. Hardware caches use direct mapped or set-associative cache\nB.  True\nA cache stores a copy of data from memory in a fast storage near the CPU. In case of TLB hit, we \ngot the physical address (in main memory). We look into cache before accessing main memory. In \ncase of a cache miss, we will definitely find the word in main memory as there was a TLB hit.\nC. True\nA hashed page table lookup may require many memory references to search the desired virtual \naddress and its corresponding frame number because there is no guarantee on the number of entries \nin the linked list.\nD.  False\nWhen a memory reference takes place, this virtual address is matched by the memory-mapping unit \nand the Inverted Page table is searched for a match and the corresponding frame number is obtained. \nIf the match is found at the ith entry then the physical address of the process is sent as the real address \notherwise if no match is found then Segmentation Fault is generated. Finding a match requires \nsearching the entire table. Depending on the match, the memory access time will vary.\nQ.47\n Which of the following statements is/are TRUE with respect to deadlocks?\n(A)  In a system where each resource has more than one instance, a cycle in its wait-for-graph indicates\nthe presence of a deadlock .\n(B)  In the resource-allocation graph of a system, if every edge is an assignment edge, then the system is\nnot in deadlock state.\n(C)  Circular wait is a necessary condition for the formation of deadlock\n(D)  If the current allocation of resources to processes leads the system to unsafe state then deadlock will\nnecessarily occur.\nSol.\n\nGATE 2022 \n [Forenoon Session]\nComputer Science Engineering\nPAGE\n33\n\nOption A:\nA cycle exist in the system but since \n1\nP\n  does not need any more resources it will finish after some\ntime and \n3\nP\n  will get resource\n1\nR\n this even in the presence of cycle the deadlock does not exist here\nR\n1\nP\n1\nP\n2\nP\n3\nR\n2\nOption B:\nWhen every edge is the assignment edge, that is, no process needs any more resources than the ones \nthat are already allocated, thus deadlock doesn't exist here.\nOption C:\nCircular wait is a necessary condition for Deadlock but it is not sufficient. There are following 4 \nnecessary conditions for the occurrence of deadlock\n1. \nMutual exclusion\n2. \nHold and wait\n3. \nNo preemption\n4. \nCircular wait\nOption D:\nEven if the allocation results in an unsafe state, some processes still may release the resources that \nare allocated to them for a while which may lead to elimination of deadlock from the system.\nDigital Logic"
}