{
  "id": "17",
  "stream": "civil-engineering",
  "packet": "2021-M",
  "year": "2021",
  "type": "MCQ",
  "key": "1.96\n\nGATE 2021 \n [Forenoon Session]\nCivil Engineering\nPAGE\n11\n\nˆ\nCLR\nW x\n=",
  "question_text": "Question 17\nAn unsupported slope of height 15 m is shown in the figure (not to scale), in which the slope face makes \nan angle 50\n˚\n with the horizontal. The slope material comprises purely cohesive soil having undrained \ncohesion 75 kPa. A trial slip circle KLM, with a radius 25 m, passes through the crest and toe of the slope \nand it subtends an angle 60\n˚\n at its center O. The weight of the active soil mass (W, Bounded by KLMN) \nis 2500 kN/m, which is acting at a horizontal distance of 10 m from the toe of the slope. Consider the \nwater table to be present at a very large depth from the ground surface.\nO\n0\n60\n25 m\nM\nN\n15 m\nL\n0\n50\nW\nK\n10m\nConsidering the trial slip circle KLM, the factor of safety against the failure of slope under undrained \ncondition (round off to two decimal places) is_________",
  "answer_text": "1.96\n\nGATE 2021 \n [Forenoon Session]\nCivil Engineering\nPAGE\n11\n\nˆ\nCLR\nW x\n=",
  "explanation_text": "Sol.\n \nFOS\n60\nˆ\n2\n25\n360\nL\n = π×\n×\nˆ\n26.18 m\nL\n =\n75 26.18 25\n2500 10\nFOS\n×\n×\n=\n×\n1.96\nFOS\n =\n \nQuestion 18 \n \nWhich one of the following is correct? \n \n(A) For an effluent sample of a sewage treatment plant, the ratio BOD \n5-day,20\n˚\nC\n upon ultimate BOD is \nmore than 1. \n \n(B) The most important type of species involved in the degradation of organic matter in the case of \nactivated sludge process based wastewater treatment is chemoheterotrophs.  \n \n(C) The partially treated effluent from a food processing industry, containing high concentration of \nbiodegradable organics, is being discharged into a flowing river at a point P. If the rate of degradation \nof the organics is higher than the rate of aeration, then dissolved oxygen of the river water will be \nlowest at point P. \n \n(D) A young lake characterized by low nutrient content and low plant productivity is called eutrophic \nlake. \nAns. \nB \nQuestion 19 \n \nA bag house filter has to treat 12m\n3\n/s of waste gas continuously. The baghouse is to be divided into 5 \nsections of equal cloth area such that one section can be shut down for cleaning and/or repairing, while \nthe other 4 sections continue to operate. An air-to-cloth ratio of 6.0m\n3\n/min-m\n2\n cloth will provide sufficient \ntreatment to the gas. The individual bags are of 32 cm in diameter and 5 m in length. The total number of \nbags (in integer) required in the baghouse is_______ \nAns. \n30 \nSol.\n \nGiven :  \n \nDischarge = 12m\n3\n/s\n3\n3\n3\n2\n12m /s\n6 m /s- m\n60\n3\n2\n12m /s\n6m / min-m\n=\n=\n= 120 m\n2\nTotal surface Area with respect to discharge\nArea of bag = \n0.32 5\n5.024\nDL\nπ\n= π×\n× =\n\n \n5\n120\n150mL\n4\n×\n=\nNumber of bag = \n150\n29.85\n30\n5.024\n \n=\n≈\n\nGATE 2021 \n [Forenoon Session]\nCivil Engineering\nPAGE\n12\n"
}