{
  "id": "40",
  "stream": "mechanical-engineering",
  "packet": "2023",
  "year": "2023",
  "type": "MCQ",
  "key": "(A)",
  "question_text": "Question 40 \n \n  \n \n[Strength of Materials]\nThe figure shows a thin-walled open-top cylindrical vessel of radius \n𝑟\n and wall thickness \n𝑡\n. The vessel is \nheld along the brim and contains a constant-density liquid to height ℎ from the base. Neglect \natmospheric pressure, the weight of the vessel and bending stresses in the vessel walls.\nWhich one of the plots depicts qualitatively CORRECT dependence of the magnitudes of axial wall \nstress \n)\n(\n1\n\n and circumferential wall stress \n)\n(\n2\n\n on \n𝑦\n?\ny\nh\nr\nt\n\n\nGATE 2023 \n [Afternoon Session]\nMechanical Engineering\nPAGE\n28\n\n(A)\n(B)\n(C)\n\n(D)",
  "answer_text": "(A)",
  "explanation_text": "Sol. \nAs we move from the free surface towards bottom, the pressure variation can be written as:\nP\ngh\n\nPD\nD\ngh\nt\nt\n\n\n\n\n\n\n\n\nNow, \n2\n2\nh\n\n\n \nh\nh\n\nh\nLongitudinal stress will be developed because of the total \namount of fluid and since this amount is constant, the \nlongitudinal stress will be constant.  \n \nHence, the correct option is (A). \nQuestion 41 \n \n  \n \n[Thermodynamics]\nWhich of the following statement is FALSE? \n \n(A) For an ideal gas, the enthalpy is independent of pressure. \n            (B) For a real gas going through an adiabatic reversible process, the process equation is given by\n,\nconst\nP\nt\nV\nan\n\n\n where P is the pressure, V is the volume and \n𝛾\n is the ratio of the specific heats of\nthe gas at constant pressure and constant volume. \n \n(C) For an ideal gas undergoing a reversible polytropic process PV\n1.5\n = constant, the equation\nconnecting the pressure, volume and temperature of the gas at any point along the process is\n.\nP\nMT\nR\nV\n\n, where \n𝑅\n is the gas constant and \n𝑚\n is the mass of the gas.\n(D) Any real gas behaves as an ideal gas at sufficiently low pressure and high temperature. \nAns. (B)\nSol.\n  \nExplanation: \nPv\nC\n\n\n is applicable for only ideal gas.\nHence, the correct option is (B).\n\nGATE 2023 \n [Afternoon Session]\nMechanical Engineering\nPAGE\n29\n"
}