{
  "id": "6",
  "stream": "civil-engineering",
  "packet": "2023-N",
  "year": "2023",
  "type": "MCQ",
  "key": "",
  "question_text": "Question 6\n \n \n \nElvesland is a country that has peculiar beliefs and practices. They express almost all their emotions by \ngifting flowers. For instance, if anyone gifts a white flower to someone, then it is always taken to be a \ndeclaration of one’s love for that person. In a similar manner, the gifting of a yellow flower to someone \noften means that one is angry with that person.  \n \nBased only on the information provided above, which one of the following sets of statement(s) can be \nlogically inferred with \ncertainty\n?  \n \n(i)  \nIn Elvesland, one always declares one’s love by gifting a white flower.  \n \n(ii)  In Elvesland, all emotions are declared by gifting flowers.  \n \n(iii)  In Elvesland, sometimes one expresses one’s anger by gifting a flower that is not yellow.  \n \n(iv)  In Elvesland, sometimes one expresses one’s love by gifting a white flower.  \n \n(A) only (ii) (B) \n(i), (ii) and (iii) \n \n(C) (i), (iii) and (iv) \n(D) only (iv) \nAns. (D) \nSol. \nGiven : \n \nElvesland is a country that has peculiar beliefs and practices. They express almost all their emotions by \ngifting flowers. For instance, if anyone gifts a white flower to someone, then it is always taken to be a \ndeclaration of one’s love for that person. In a similar manner, the gifting of a yellow flower to someone \noften means that one is angry with that person. \n \n(i)  \nIn Elvesland, one always declares one’s love by gifting a white flower cannot be inferred with \ncertainty, as gifting white flower is sign of declaration of ones love for the person. It is not declares \nby a person. \n \n(ii)  In Elvesland, all emotions are declared by gifting flowers cannot be inferred with certainty, as they\nexpress “almost all” their emotions by gifting flowers. Therefore “All” (definite) cannot be true. \n \n(iii)  In Elvesland, sometimes one expresses one’s anger by gifting a flower that is not yellow is\ndefinitely cannot inferred as the gifting of a yellow flower to someone often means that one is \nangry with that person.  \n \n(iv)  In Elvesland, sometimes one expresses one’s love by gifting a white flower can be inferred with\ncertainty, as if anyone gifts a white flower to someone, then it is always taken to be a declaration \nof one’s love for that person.  \n \nHence, the correct option is (D).\n\nGATE 2023 \n [Afternoon Session]\nCivil Engineering\nPAGE\n4\n",
  "answer_text": "",
  "explanation_text": ""
}