{
  "id": "6",
  "stream": "mechanical-engineering",
  "packet": "2023",
  "year": "2023",
  "type": "MCQ",
  "key": "",
  "question_text": "Question 6 \n \n \nIn a recently held parents-teacher meeting, the teachers had very few complaints about Ravi. After all, \nRavi was a hardworking and kind student. Incidentally, almost all of Ravi’s friends at school were hard \nworking and kind too, but the teachers drew attention to Ravi’s complete lack of interest in sports. The \nteachers believed that along with some of his friends who shows similar disinterest in sports, Ravi needed \nto engage in some sports for his overall development.  \n \nBased only on the information provided above, which one of the following statements can be logically \ninferred with certainty? \n \n(A) All of Ravi’s friends are hardworking and kind. \n \n(B) No one who is not a friend of Ravi is hardworking and kind. \n \n(C)  None of Ravi’s friends are interested in sports. \n \n(D) Some of Ravi’s friends are hardworking and kind. \nAns. (D) \nSol.\n \nGiven : \n \nIn a recently held parents teacher meeting, the teachers had very few complaints about Ravi. After all, \nRavi was a hardworking and kind student. Incidentally, almost all of Ravi’s friends at school were hard \nworking and kind too. But the teachers drew attention to Ravi’s complete lack of interest in sports. The \nteachers believed that along with some of his friends who shows similar disinterest in sports, Ravi needed \nto engage in some sports for his overall development.  \n \nOption (A) is not correct, as only some of Ravi’s friend are hardworking and kind. \n \nOption (B) is not correct, as almost all Ravi’s friend are hardworking and kind. \n \nOption (C) is not correct, as some of the Ravi’s friend are interested in sports. \n \nOption (D) is correct, as all of Ravi’s friends are hardworking and kind. \n \nHence, the correct option is (D).\n \nQuestion 7 \n \nThere are two inequalities :\n\n\n2\n4\n4\np\nq\n\n\n\n\n3\n2\n6\np\nq\n\nGATE 2023 \n [Afternoon Session]\nMechanical Engineering\nPAGE\n5\n\nWhere p and q are positive integers. The value of p + q is __________. \n \n(A) 2 \n(B) 1 \n \n(C) 3 \n(D) 4 \nAns. (A) \nSol.\n \n3\n2\n6\np\nq\n\n\n6\n4\n12\n4\n12\n6   ......(i)\np\nq\nq\np\n\n\n\n\n\n\n2\np\nq\n4\n4\n\n\n2\np\nq\n4\n4    ......(ii)\n\n\n\n\n\n2\np\np\n4\n12\n6\n\n\n\n2\np\np\n6\n16\n0\n\n\n\n\n2\np\np\np\n8\n2\n16\n0\n\n\n\n\n\n\np p\np\n(\n8)\n2(\n8)\n0\n\n\n\n(\n8)(\n2)\n0\np\np\n\np\n( 8,2)\nSince \np\n is positive integer \n \nSo, \np\n = 1 \n \nUsing this in equation (i)\n\n\n\n4\n12\n6   (\n1)\nq\np\np\n\n4\n6\nq\n\n\n3\n2\n1\n\nq\n\nq\n\n \n2\np\nq\n\n\nHence, the correct option is (A).\n \nQuestion 8 \n \nWhich one of the sentence sequence in the given option creates a coherent narrative? \n \n(i) \nI could not bring myself to knock \n \n(ii) There was a number of unfamiliar voices coming from the big drawing room and the door was firmly\nshut. \n \n(iii) The passage was dark for a bit, but then it suddenly opened into a bright kitchen. \n \n(iv) I decided I would rather wander down the passage. \n \n(A) (iv), (i), (iii), (ii) \n(B)  (iii), (i), (ii), (iv) \n \n(C) (ii), (i), (iv), (iii) \n(D) (i), (iii), (ii), (iv) \nAns. (C) \nSol.\n \nGiven : \n \n1. \nI could not bring myself to knock\n\nGATE 2023 \n [Afternoon Session]\nMechanical Engineering\nPAGE\n6\n\n2. \nThere was a number of unfamiliar voices coming from the big drawing room and the door was firmly \nshut. \n \n3. \nThe passage was dark for a bit, but then it suddenly opened into a bright kitchen. \n \n4. \nI decided I would rather wander down the passage.\n \n \nWe will make pair of two sentence for the sequences which creates a coherent narrative. \n \nThe pairs will be 2-1 and 4-3 which gives a meaningful narrative. \n \nAccording to the options, sequence in option (C) will give best coherent meaning.  \n \nHence, the correct option is (C).  \nQuestion 9 \n \n \nHow many pairs of sets (S, T) are possible among the subsets of {1, 2, 3, 4, 5, 6} that satisfy the condition \nthat S is subset of T?  \n \n(A) 729 \n(B) 728 \n \n(C) 665 \n(D) 664 \nAns.   (A) \nSol. \nLet two number be (5, 6) \n \nT\n \n \nS\n \n \n- 1 \n \n5\nT\n \n \n,5\nS\n \n \n- 2 \n \n6\nT\n \n \n,6\nS\n \n \n- 2 \n \n5,6\nT\n \n \n,5,6\nS\n \n \n- 3 \n \nHere, we get 9 possibilities (1+2+2+3) which is 3\n2\nSo, \n2\n(5,6)\n3\n9\n\n\n\n\n3\n4\n(4,5,6)\n3\n27\n\n\n\n\n(3,4,5,6)\n3\n81\nSimilarly, \n6\n(1,2,3,4,5,6)\n3\n729\n\n\n \n \nHence, the correct option is (A). \nQuestion 10 \n \nAn opaque pyramid (shown below), with a square base and isosceles faces, is suspended in the path of a \nparallel beam of light, such that its shadow is cast on a screen oriented perpendicular to the direction of \nthe light beam. The pyramid can be reoriented in any direction within the light beam. Under these \nconditions, which one of the shadows P, Q, R, and S is NOT possible?\nOpaque\npyramid\n\n\nGATE 2023 \n [Afternoon Session]\nMechanical Engineering\nPAGE\n7\n\nP\nQ\nR\nS\n(A) P \n(B) Q \n \n(C) R \n(D) S \nAns. (B)  \nSol.\n \nGiven :\n  \n \nAn opaque pyramid with a square base and isosceles faces is suspended in the path of a parallel beam of \nlight such that its shadow is cast an a screen oriented perpendicular to the direction of the light beam.  \n \nThe pyramid can be reoriented in any direction within the light beam under these conditions the shadow \nQ, is not possible. \n \nHence, the correct option is (B).\n\n..\nQ.11 to Q.35 Carry One Mark Each\n..",
  "answer_text": "",
  "explanation_text": ""
}