{
  "id": "5",
  "stream": "electronics-and-communication-engineering",
  "packet": "2022",
  "year": "2022",
  "type": "MCQ",
  "key": "",
  "question_text": "Question 5 \n \nAn art gallery engages a security guard to ensure that the items displayed are protected. The diagram \nbelow represents the plan of the gallery where the boundary walls are opaque. The location the security \nguard posted is identified such that all the inner space (shaded region in the plan) of the gallery is within \nthe line of sight of the security guard.\nIf the security guard does not move around the posted location and has a 360\no\n view, which one of the \nfollowing correctly represents the set of ALL possible locations among the locations P, Q, R and S, where \nthe security guard can be posted to watch over the entire inner space of the gallery.\nP\nR\nQ\nS\n(A) \nP\n and \nQ\n \n(B) \nQ\n and \nS\n \n \n(C) \nR\n and \nS\n \n(D) \nQ\n \nAns. \nB \n \nSol.\n \nGiven : \nThe diagram below represents the plan of the gallery where the boundary wall are opaque.\nP\nR\nQ\nS\nThe art gallery engages a security guard to ensure that the items displayed are protected. \n \nThe location where the security guard posted is identified such that all the inner space of the gallery is \nwithin the line of sight of the security guard. \n \nThe condition is if the security guard does not move around the posted location and has 360\n0\n view, \n \nThe set of all possible location among the locations P, Q, R and S are Q and S from where the security \nguard can be posted to watch over the entire inner space of the gallery \n \nHence, the current option is (B).\nQ.6 to Q.10 Carry TWO Marks Each \nQuestion 6 \n \nMosquitoes pose a threat to human health. Controlling mosquitoes using chemicals may have undesired \nconsequences. In Florida, authorities have used genetically modified mosquitoes to control the overall \nmosquito population. It remains to be seen if this novel approach has unforeseen consequences.\n\nGATE 2022 \n [Forenoon Session]\nElectronics & Communication Engineering\nPAGE\n5\n\nWhich one of the following is the correct logical inference based on the information in the above passage?  \n \n(A) Using genetically modified mosquitoes is better than using chemicals to kill mosquitoes because they \ndo not have any side effects.   \n \n(B) Using chemicals to kill mosquitoes may have undesired consequences but it is not clear if using \ngenetically modified mosquitoes has any negative consequence. \n \n(C) Using chemicals to kill mosquitoes is better than using genetically modified mosquitoes because \ngenetic engineering is dangerous. \n \n(D) Both using genetically modified mosquitoes and chemicals have undesired consequences and can be \ndangerous. \nAns. \nB \nSol.\n \nOption (A), in this option, it is mentioned that “genetically modified mosquitoes are better than using \nchemical to kill mosquitoes” which is not mentioned in the given passage and that’s why this option is \neliminated. \n \nOption (B), in this option, it is clearly mentioned in given passage that “using chemical to kill mosquitoes \nmay have undesired consequences but it is not clear if using genetically modified mosquitoes has any \nnegative consequence” so this option is correct. \n \nOption (C), in this option, it is mentioned “genetic engineering is dangerous” which is not mentioned so \nthis option is also eliminated. \n \nOption (D), in this option, it is mentioned that “both using genetically modified mosquitoes and chemicals \nhave undesired consequence and can be dangerous” which is not related to given passage so this option is \nalso eliminated.  \n \nHence, the correct option is (B). \nQuestion 7 \n \n \nConsider the following inequalities. \n \n(i) \n2\n1 7\nx\n\n \n(ii) \n2\n9 1\nx\n\n \n \nWhich one of the following expressions below satisfies the above two inequalities? \n \n(A) \n4\nx\n \n \n(B) \n4\n4\nx\n\n\n \n \n(C) \n5\nx\n \n \n(D) \n4\n5\nx\n\n \nAns. \nD \nSol.\n \nGiven : \nFirst Inequality, \n2\n1 7\nx\n\n \n \n \n \n2\n1 7\nx\n\n \n \n \n \n2\n8\nx\n \n \n \n \n \n4\nx\n \n \n \nAnd second Inequality, \n2\n9 1\nx\n\n \n \n \n \n2\n9 1\nx\n\n \n \n \n \n2\n10\nx\n \n \n \n \n \n5\nx\n \n \n \nBy these two Inequalities we have value of \nx\n as 4 < \nx\n < 5. \n \nHence, the correct option is (D).\n\nGATE 2022 \n [Forenoon Session]\nElectronics & Communication Engineering\nPAGE\n6\n",
  "answer_text": "",
  "explanation_text": ""
}