{
  "id": "6",
  "stream": "instrumentation-engineering",
  "packet": "2024",
  "year": "2024",
  "type": "MCQ",
  "key": "(A)\n\nPAGE\n4",
  "question_text": "Question 6 \n \nIn the given text, the blanks are numbered (i)-(iv).  Select the best match for all the blanks. \n \nYoko Roi stands        \n(i)  \n        as an author for standing   \n(ii)\n \n   as an honorary fellow, after she \nstood        \n(iii)\n        her writings that stand  \n(iv)\n \n the freedom of speech. \n \n(A) (i)  out     (ii)  down     (iii) in     (iv)  for \n \n \n(B) (i)  down     (ii)  out     (iii) by     (iv)  in \n \n(C) (i)  down     (ii)  out     (iii) for     (iv)  in \n \n \n(D)  (i)  out     (ii)  down     (iii) by     (iv)  for \nAns. \n(D)\n \nQuestion 7 \n \nSeven identical cylindrical chalk-sticks are fitted tightly in a cylindrical container.  The figure below \nshows the arrangement of the chalk-sticks inside the cylinder.\nThe length of the container is equal to the length of the chalk-sticks.  The ratio of the occupied space to \nthe empty space of the container is   \n \n(A) 5/2 \n(B) 7/2 \n \n(C) 9/2 \n(D) 3 \nAns. \n(B)\n \nQuestion 8 \n \nThe plot below shows the relationship between the mortality risk of cardiovascular disease and the number \nof steps a person walks per day.  Based on the data, which one of the following options is true ?\n\nPAGE\n3\n\n(A) The risk reduction on increasing the steps/day from 0 to 10000 is less than the risk reduction on\nincreasing the steps/day from 10000 to 20000.  \n \n(B) The risk reduction on increasing the steps/day from 0 to 5000 is less than the risk reduction on\nincreasing the steps/day from 15000 to 20000. \n \n(C) For any 5000 increment in steps/day the largest risk reduction occurs on going from 0 to 5000 \n \n \n(D) For any 5000 increment in steps/day the largest risk reduction occurs on going from 15000 to 20000 \nAns. \n(C)\n \nQuestion 9 \n \nFive cubes of identical size and another smaller cube are assembled as shown in Figure A.  If viewed from \ndirection \nX\n , the planar image of the assembly appears as Figure B.\nIf viewed from direction \nY\n , the planar image of the assembly (Figure A) will appear as  \n(A)  \n(B)\n(C)  \n(D)",
  "answer_text": "(A)\n\nPAGE\n4",
  "explanation_text": ""
}