{
  "id": "6",
  "stream": "instrumentation-engineering",
  "packet": "2023",
  "year": "2023",
  "type": "MCQ",
  "key": "",
  "question_text": "Question 6 \n \nResidency is a famous housing complex with many well-established individuals among its residents. A \nrecent survey conducted among the residents of the complex revealed that all of those residents who are \nwell established in their respective fields happen to be academicians. The survey also revealed that most \nof these academicians are authors of some best-selling books.\n \n \nBased only on the information provided above, which one of the following statements can be logically \ninferred with certainty? \n \n(A) Some residents of the complex who are well established in their fields are also authors of some\nbest-selling books. \n \n(B)  All academicians residing in the complex are well established in their fields \n \n(C) Some authors of best-selling books are residents of the complex who are well-established in their\nfields\n\nGATE 2023\n  [Forenoon Session]\nInstrumentation Engineering\nPAGE\n3\n\n(D) Some academicians residing in the complex are well established in their fields. \nAns. (D) \nSol. \nResidency is a famous housing complex with many well-established individuals among its residents. A \nrecent survey conducted among the residents of the complex revealed that all of those residents who are \nwell established in their respective fields happen to be academicians. From this information we can \neasily inferred that “Some academicians residing in the complex are well established in their fields” \noption (D) is correct.   \n \nOption (C) cannot be inferred with certainty as it is not a necessary condition some residents who are \nestablished in their field cannot be the authors of any book.  \n \nOption (B) can also not be inferred as it is clearly mention in the passage, all those residents who are \nwell established in their respective field are academicians and vice-versa cannot be certainly inferred. \n \nOption (A) can also not be inferred as “some authors of bestselling books are residents of the complex \nwho are wells established in their fields.” Are academicians which is not mention in option.  \n \nHence, the correct option is (D).\n \nQuestion 7 \n \nAnkita has to climb 5 stairs starting at the ground, while respecting the following rules : \n \n1. \nAt any stage, Ankita can move either one or two stairs up. \n \n2. \nAt any stage, Ankita cannot move to a lower step. \n \nLet \n( )\nF N\n  denote the number of possible ways in which Ankita can reach the \nN\nth \nstair.\nFor example, \n(1)\n1, (2)\n2, (3)\n3.\nF\nF\nF\n\n\n\nThe value of \n(5)\nF\n is _______. \n \n \n(A) 8 \n(B) 7  \n \n(C) 6 \n(D) 5 \nAns. (A) \nQuestion 8 \n \nThe information contained in DNA is used to synthesize proteins that are necessary for the functioning \nof life. DNA is composed of four nucleotides: Adenine (A), Thymine (T), Cytosine (C), and Guanine \n(G). The information contained in DNA can then be thought of as a sequence of these four nucleotides: \nA, T, C, and G. DNA has coding and non-coding regions. Coding regions where the sequence of these \nnucleotides are read in groups of three to produce individual amino acids—constitute only about 2% of \nhuman DNA. For example, the triplet of nucleotides CCG codes for the amino acid glycine, while the \ntriplet GGA codes for the amino acid proline. Multiple amino acids are then assembled to form a \nprotein. \n \nBased only on the information provided above, which of the following statements can be logically \ninferred with certainty? \n \n(i) \nThe majority of human DNA has no role in the synthesis of proteins. \n \n(ii) The function of about 98% of human DNA is not understood. \n \n(A) only (i) \n(B) only (ii) \n \n(C) both (i) and (ii) \n(D) neither (i) nor (ii) \nAns. (C)\n\nGATE 2023\n  [Forenoon Session]\nInstrumentation Engineering\nPAGE\n4\n",
  "answer_text": "",
  "explanation_text": "Sol. \n(i) \nThe majority of human DNA has no rule in the synthesis of proteins can be inferred with certainty, \nas “the information contained in DNA is used to synthesis proteins is given in the passage. Apart \nfrom this there in no information in passage that how much part of human DNA has role in the \nsynthesis of proteins.  \n \n(ii) The function of about 98% of human DNA is not understood can be inferred with certainty as\n“DNA has coding and non-coding regions. Coding regions constitute only about 2% of human \nDNA” is given in the passage and we have no information about non-coding region of DNA in the \npassage.  \n \nHence, the correct option is (D).\n \nQuestion 9 \n \nWhich one of the given figures \nP\n, \nQ\n, \nR\n and \nS\n represents the graph of the following function?\n( )\n2\n1\nf x\nx\nx\n\n\n\n\n\n(A)\n P \n(B) \nQ\n \n \n(C) \nR \n(D) \nS \nAns. (A) \nQuestion 10 \n \nAn opaque cylinder (shown below) is suspended in the path of a parallel beam of light, such that its \nshadow is cast on a screen oriented perpendicular to the direction of the light beam. The cylinder can be\n\nGATE 2023\n  [Forenoon Session]\nInstrumentation Engineering\nPAGE\n5\n\nreoriented in any direction within the light beam, Under these conditions, which one of the shadows \nP\n, \nQ\n, \nR\n and \nS\n is NOT possible?\n(A) \nP \n(B) \nQ \n \n(C) \nR \n(D) \nS \nAns. (D) \nSol. \nGiven :\n An opaque cylinder is suspended in the path of a parallel beam of light such that its shadow is \ncast on a screen oriented perpendicular to the direction of light beam.  \n \nThe cylinder can be reoriented in any direction within the light beam. Under these conditions shadow S \nis not possible.  \n \nHence, the correct option is (D).\n\n..\nQ.11 to Q.35 Carry One Mark Each\n.."
}